{
  "TheElder": {
    "name": "The Elder of Aspects",
    "role": "Mentor / Quest Giver",
    "full_description": "An ancient and ageless figure who conducts the Choosing ceremony. Dressed in shimmering robes that shift between red, green, blue, and gold. Wise eyes that have seen countless heroes rise. Voice like warm thunder - powerful but kind.",
    "description_components": {
      "head_face": "Ageless androgynous face, neither young nor old, wise knowing eyes that shift color subtly, long silver-white hair flowing freely, serene expression of ancient wisdom",
      "body_build": "Tall and graceful, neither frail nor imposing, moves with supernatural smoothness, age indeterminate",
      "armor_clothing": "Flowing ceremonial robes that shimmer and shift between red green blue and gold, embroidered with Aspect symbols, barefoot on sacred ground",
      "accessories": "Simple circlet of intertwined metals (iron silver copper gold) representing the four Aspects, no staff or weapon, hands often raised in blessing"
    }
  },
  "ElderWeakened": {
    "name": "The Elder (Weakened by Shadow)",
    "role": "Mentor in Peril",
    "full_description": "The Elder after the Temple has been corrupted by shadow magic. Still dignified but visibly weakened, robes dimmed, struggling to stand. Pleads with the hero to save the beloved NPC and stop the Specter.",
    "description_components": {
      "head_face": "Same ageless face now drawn with strain, eyes flickering weakly between colors, silver hair disheveled, expression of desperate hope",
      "body_build": "Same tall frame now hunched and weakened, leaning against temple wall for support, trembling slightly",
      "armor_clothing": "Ceremonial robes now dimmed and tattered at edges, colors muted and flickering, bare feet dirty from corrupted stone",
      "accessories": "Circlet still worn but glowing weakly, one hand clutching chest, other reaching toward hero"
    }
  },
  "GarrettMerchant": {
    "name": "Garrett the Traveling Merchant",
    "role": "Rescued NPC / Reward Giver",
    "full_description": "A weathered but cheerful traveling merchant with a grey beard and kind eyes. Dressed in practical traveling clothes with many pockets. Grateful to be rescued from goblins and eager to reward his savior with goods from his wagon.",
    "description_components": {
      "head_face": "Weathered human face with laugh lines, bushy grey beard, kind twinkling brown eyes, balding head with remaining grey hair, grateful relieved expression",
      "body_build": "Stocky middle-aged build, slight paunch from good living, strong arms from loading wagons, mid-50s",
      "armor_clothing": "Practical brown traveling coat with many pockets, cream linen shirt, sturdy leather belt with coin pouches, worn leather boots",
      "accessories": "Leather satchel over shoulder, merchant guild medallion on chain, small knife at belt for cutting rope and packages"
    }
  },
  "GarrettHiding": {
    "name": "Garrett (Under Attack)",
    "role": "NPC in Peril",
    "full_description": "Garrett cowering behind his wagon as goblin arrows thud into the wood around him. Terrified but calling for help. Trying to protect his draft horse while staying in cover.",
    "description_components": {
      "head_face": "Same weathered face now pale with fear, eyes wide and searching for help, beard disheveled, mouth open calling for aid",
      "body_build": "Same stocky frame now crouched low behind wagon wheel, making himself small",
      "armor_clothing": "Same traveling clothes now dusty and dirty, coat torn by near-miss arrow, one pocket ripped open",
      "accessories": "Hat fallen off nearby, satchel clutched protectively, one hand on horse's bridle trying to calm it"
    }
  },
  "Starwind": {
    "name": "Starwind the Pegasus",
    "role": "Rescued Ally / Mount",
    "full_description": "A magnificent winged horse with a pure white coat and feathered wings spanning 20 feet. Noble and intelligent, with silver hooves and a flowing mane. Freed from shadow chains and eternally grateful, offering to carry the hero.",
    "description_components": {
      "head_face": "Noble equine head with intelligent expressive eyes, flowing silver-white mane, alert ears, ethereal beauty",
      "body_build": "Powerful athletic horse body, pure white coat that seems to glow faintly, muscular haunches for powerful flight",
      "armor_clothing": "No tack or saddle, natural wild freedom, coat pristine white with faint celestial shimmer",
      "accessories": "Massive feathered wings spanning 20 feet pure white, silver hooves that gleam, flowing tail like spun moonlight"
    }
  },
  "StarwindCursed": {
    "name": "Starwind (Bound by Shadow)",
    "role": "NPC in Peril",
    "full_description": "The same magnificent pegasus but trapped and suffering. Shadow chains bind her legs, her wings hang limp and grey, eyes full of pain. Dark energy crackles around her as shadows circle menacingly.",
    "description_components": {
      "head_face": "Same noble head now lowered in pain, eyes pleading for help, mane tangled and dimmed, sweat on brow",
      "body_build": "Same powerful body now trembling, legs buckling under weight of shadow chains, coat dulled from white to grey",
      "armor_clothing": "Chains of pure shadow wrapped around legs, dark energy crackling where chains touch, no celestial glow",
      "accessories": "Wings hanging limp at sides feathers turning grey, silver hooves dimmed to dull pewter, tail dragging on ground"
    }
  },
  "Pip": {
    "name": "Pip the Pseudodragon",
    "role": "Rescued Companion",
    "full_description": "A cat-sized dragon with reddish-brown scales and iridescent bat-like wings. Large expressive eyes full of intelligence and emotion. Found injured in the maze, becomes a loyal companion when shown kindness. Communicates through emotion rather than words.",
    "description_components": {
      "head_face": "Small dragon head with large expressive amber eyes, tiny horns, snout like a cat, intelligent curious expression",
      "body_build": "Cat-sized dragon body covered in reddish-brown scales, sinuous and graceful, long neck and tail",
      "armor_clothing": "Natural scales in warm reddish-brown tones, iridescent sheen catching light, no clothing or adornment",
      "accessories": "Bat-like wings folded or spread, long tail ending in venomous stinger (only used to help friends), small clawed feet for perching on shoulders"
    }
  },
  "PipInjured": {
    "name": "Pip (Injured in Maze)",
    "role": "NPC in Need",
    "full_description": "The same pseudodragon but hurt and frightened. One wing bent at wrong angle, curled up protectively in hidden alcove. Eyes huge with fear and hope when first seen. Surrounded by tiny treasures collected before injury.",
    "description_components": {
      "head_face": "Same small dragon head, eyes enormous with fear and hope, pressed low against ground, tiny whimper",
      "body_build": "Same cat-sized body curled up defensively, one wing bent at painful angle, shivering slightly",
      "armor_clothing": "Same reddish-brown scales now dusty, some scales scuffed from injury, iridescence dimmed",
      "accessories": "One wing bent wrong trailing painfully, tail curled around body protectively, surrounded by small shiny treasures (coins broken crystal pretty stones)"
    }
  },
  "DireWolfAlly": {
    "name": "The Redeemed Dire Wolf",
    "role": "Rescued Ally",
    "full_description": "An enormous wolf the size of a horse, with thick silver-grey fur. Once cursed and in pain, now healed and loyal. Intelligent pack-hunter eyes now show gratitude and devotion. Follows at respectful distance, ready to protect.",
    "description_components": {
      "head_face": "Massive wolf head with intelligent amber eyes, thick fur around neck like mane, ears alert, expression of loyalty and gratitude",
      "body_build": "Enormous wolf size of a horse, powerful shoulders and haunches, thick silver-grey fur, healthy and strong",
      "armor_clothing": "Natural thick grey fur, no collar or harness, wild but allied",
      "accessories": "Faint scar on front leg where curse once bound it, no other markings, moves with pack-hunter grace"
    }
  },
  "HeroPlaceholder": {
    "name": "[HERO NAME]",
    "role": "Main Character",
    "full_description": "A young hero on the day of their Choosing, discovering their true potential. Appearance determined by Hendrix's choices. Carries the Aspect cards and faces trials with courage. By the end, their true class will be revealed.",
    "description_components": {
      "head_face": "[To be determined by Hendrix - age, race, features, expression]",
      "body_build": "[To be determined - young, athletic, appropriate for a new adventurer]",
      "armor_clothing": "[To be determined - starting outfit suitable for ceremony, may change during adventure]",
      "accessories": "[The Aspect Cards - deck of glowing cards in red green blue gold, plus any items gained during trials]"
    }
  },
  "BelovedNPCPlaceholder": {
    "name": "[BELOVED NPC NAME]",
    "role": "Motivation / Final Rescue Target",
    "full_description": "The person or creature the hero cares about most. Determined by Hendrix at the start of the adventure. Captured by the Specter and held in the Temple Sanctum. Their rescue is the final trial's emotional core.",
    "description_components": {
      "head_face": "[To be determined by Hendrix - could be parent, friend, sibling, mentor, or pet]",
      "body_build": "[To be determined based on who Hendrix chooses]",
      "armor_clothing": "[To be determined - appropriate for their role in hero's life]",
      "accessories": "[To be determined - something meaningful that connects them to the hero]"
    }
  },
  "BelovedCaptured": {
    "name": "[BELOVED NPC] (Captured)",
    "role": "Hostage",
    "full_description": "The beloved NPC bound to the altar by shadow chains, frightened but hopeful upon seeing the hero. The emotional stakes of the final confrontation. Their faith in the hero never wavers.",
    "description_components": {
      "head_face": "[Same as beloved NPC but showing fear, relief at seeing hero, faith in their rescue]",
      "body_build": "[Same but restrained, unable to move freely, straining toward hero]",
      "armor_clothing": "[Same but disheveled, possibly torn from struggle]",
      "accessories": "[Shadow chains binding them to altar, meaningful item still visible]"
    }
  }
}
