{
  "the PlayerRoom": {
    "name": "Lightsword's Cave Bedroom",
    "full_description": "A cozy bedroom carved into a natural underground cave. A small river runs directly through the room, its gentle burbling a constant companion. Bioluminescent fungi and crystals provide soft light. Fish swim lazily in the clear water. The bed is carved from stone but piled with comfortable furs.",
    "description_components": {
      "architecture": "Natural cave chamber with smooth stone walls, stalactites hanging from ceiling, carved stone furniture, river channel running through the middle of the room",
      "atmosphere": "Peaceful underground sanctuary, sound of flowing water, cool and comfortable, sense of hidden wonder",
      "lighting": "Soft bioluminescent glow from fungi and crystals on walls, shimmering reflections from the river, no sunlight - warmly lit by glowing mushrooms and crystals",
      "key_features": "Underground river with colorful fish swimming through the bedroom, stone bed piled with furs, glowing mushrooms and crystals everywhere, cozy cave dwelling"
    }
  },
  "VillageStreet": {
    "name": "Underground Village on Choosing Day",
    "full_description": "A bustling underground village carved into vast caverns. Myconids and other underground folk have paused their work to watch young candidates walk toward the Temple. Glowing banners of bioluminescent fabric flutter from stalactites, and the atmosphere is charged with excitement.",
    "description_components": {
      "architecture": "Vast underground cavern with carved walkways, mushroom gardens, glowing crystal formations, bridges over underground streams",
      "atmosphere": "Festive excitement, myconids releasing celebratory spores, underground creatures watching, sense of ancient ceremony",
      "lighting": "Bioluminescent fungi, glowing crystals, magical lanterns casting colorful light, no sun but brilliantly lit by underground sources",
      "key_features": "Colorful glowing banners in red green blue and gold hanging from stalactites, myconids and cave dwellers lining the paths, luminescent flower petals scattered on stone, Temple cavern visible ahead"
    }
  },
  "TempleCourtyard": {
    "name": "Temple of Aspects - Grand Cavern",
    "full_description": "A sacred underground cathedral carved into a massive natural cavern. The Temple of Aspects rises from the cavern floor, its four towers reaching toward the distant ceiling where massive crystals glow in red, green, blue, and gold. Young candidates gather nervously on the polished stone floor while guards stand at attention. Stalactites hang like chandeliers above.",
    "description_components": {
      "architecture": "Massive underground cavern cathedral, ancient temple facade carved from living rock with four towers each glowing a different color (red green blue gold), ornate stone archways, ceremonial steps leading to temple doors, stalactites hanging from high ceiling",
      "atmosphere": "Sacred and ancient underground sanctuary, magical energy humming in air, nervous excitement of candidates, solemn ceremony about to begin",
      "lighting": "No sunlight - brilliant bioluminescent crystals in the high ceiling glow in four colors matching the Aspect towers, each tower radiating its own colored light, magical glow throughout the cavern",
      "key_features": "Four glowing stone pillars (red warrior green hunter blue arcane gold divine), ancient temple doors carved with symbols, colorful banners matching tower colors, ceremonial guards in gleaming armor, massive stalactites overhead, carved stone walls of the cavern"
    }
  },
  "TempleSanctum": {
    "name": "Temple of Aspects - Inner Sanctum",
    "full_description": "The sacred heart of the Temple - a circular domed chamber deep underground. The ceiling is a natural dome of crystal that glows with magical starlight, creating the illusion of a night sky with constellations. A stone altar stands in the center. In times of peace, this room glows with divine light; when corrupted by shadow, it becomes dark and menacing.",
    "description_components": {
      "architecture": "Circular domed underground chamber of polished white stone, high natural crystal ceiling that creates magical starlight effect, no windows - all light from crystals and magic, stone altar in center",
      "atmosphere": "Sacred and powerful underground sanctuary, normally filled with divine crystal light, can shift to ominous when corrupted by shadow magic",
      "lighting": "Magical starlight from crystal ceiling creating illusion of night sky, or corrupted with unnatural darkness and cold shadow mist",
      "key_features": "Central stone altar with ancient runes, domed crystal ceiling painted with stars and constellations, four alcoves with statues representing the Aspects, tall ceremonial candles, deep underground sacred space"
    }
  },
  "WhisperingValley": {
    "name": "The Whispering Caverns",
    "full_description": "A vast network of interconnected underground caverns stretching out from the Temple, where the Trials of Choosing take place. Ancient paths wind through varied underground terrain - from peaceful mushroom forests to dark crystal grottos. The caverns seem to shift and change, responding to the magic of the Choosing. Echoes whisper from every direction.",
    "description_components": {
      "architecture": "Natural underground cavern network, ancient stone path winding through varied cave terrain, occasional waymarker stones carved with Aspect symbols, massive stalagmites and stalactites",
      "atmosphere": "Mystical and ever-changing underground world, light mist curling along cave floor, sense of being tested and watched, echoes whispering",
      "lighting": "Bioluminescent fungi and crystals providing ambient light, patches of bright crystal clusters and darker shadows, mist diffusing the glow",
      "key_features": "Winding ancient stone path through caverns, carved waymarker stones, varied underground terrain visible ahead (bridge cavern, mushroom forest, crystal grotto, ruined structures), distant Temple glow visible behind"
    }
  },
  "StoneBridge": {
    "name": "The Underground Stone Bridge",
    "full_description": "An ancient moss-covered stone bridge spanning a rushing underground river. The bridge arches over a dark chasm where the river flows far below, its roar echoing off cave walls. Bioluminescent fungi cling to the ancient stonework. The bridge is the only crossing point in this cavern, making it a natural chokepoint.",
    "description_components": {
      "architecture": "Ancient stone arch bridge, moss and glowing fungi covering stones, crumbling edges, weathered carvings on railings, single span over deep underground river chasm",
      "atmosphere": "Tense confrontation, sound of rushing water echoing below, wounded animal in pain and fear, sense of danger and choice in the underground darkness",
      "lighting": "Bioluminescent fungi on bridge stones and cave walls, dim blue-green glow reflecting off rushing water far below, shadows pooling in the chasm",
      "key_features": "Moss and fungi covered stone bridge with low walls, rushing underground river in deep chasm below, steep cave walls on either side, cavern tunnels at both ends, stalactites dripping overhead"
    }
  },
  "TowerRuins": {
    "name": "The Ruined Underground Tower",
    "full_description": "Crumbling ruins of an ancient watchtower built into a large cavern, about 30 feet high, carved from a massive stalagmite formation. Goblin archers have claimed the high ground and are firing down at a trapped merchant wagon on the cavern floor. Broken stone provides cover, and a half-collapsed spiral stairway winds up the formation.",
    "description_components": {
      "architecture": "Ruined stone watchtower carved from massive stalagmite, 30 feet tall, crumbling walls with arrow slits, half-collapsed spiral stairway inside, scattered rubble on cavern floor",
      "atmosphere": "Active combat zone in underground cavern, arrows flying, shouts and cries echoing off cave walls, merchant in peril, tactical challenge",
      "lighting": "Dim bioluminescent glow from cave ceiling crystals, flickering goblin torches on tower, shadows within tower ruins, dust and debris in air",
      "key_features": "Crumbling tower carved from stalagmite with goblin archers on top, wide cavern floor with trapped merchant wagon, scattered stone rubble for cover, collapsed sections creating entry points, stalactites overhead"
    }
  },
  "MerchantWagon": {
    "name": "Garrett's Merchant Wagon",
    "full_description": "A sturdy traveling merchant's wagon, painted in cheerful colors, now riddled with goblin arrows. Designed for underground trade routes with luminescent paint that glows softly. A grey-bearded merchant cowers behind it for cover. Scattered trade goods lie around - fabrics, tools, provisions - evidence of a prosperous journey through the caverns interrupted.",
    "description_components": {
      "architecture": "Four-wheeled wooden merchant wagon with canvas cover, painted panels with luminescent trade symbols that glow in cave darkness, wooden chests and crates lashed to sides",
      "atmosphere": "Desperate shelter under attack in underground cavern, arrows thudding into wood, frightened but hopeful merchant, scattered valuable goods",
      "lighting": "Luminescent paint on wagon glowing softly, dim cave ambient light, wagon casting shadow providing cover",
      "key_features": "Colorful painted wagon with glowing symbols riddled with arrows, canvas cover torn, trade goods scattered (fabric bolts weapon crates food barrels), draft beast cowering nearby"
    }
  },
  "MazeEntrance": {
    "name": "Entrance to the Crystal Maze",
    "full_description": "A dark archway carved into a massive crystal formation, marking the entrance to the Maze of Echoes. Ancient runes glow faintly around the arch. Beyond, crystalline walls shimmer with magical light, reflecting infinite images and hiding the true path. The maze is carved deep into the underground crystal deposits.",
    "description_components": {
      "architecture": "Carved crystal archway in massive underground crystal formation, ancient runes etched around arch, crystal-lined corridor visible beyond, no visible exit",
      "atmosphere": "Mysterious and magical underground labyrinth, humming with arcane energy, sense of puzzle and challenge, faint sounds echoing from within",
      "lighting": "Magical glow from runes, prismatic light refracting from crystal walls within, no natural light - all crystal luminescence",
      "key_features": "Crystal archway with glowing runes, crystalline walls beyond reflecting light and images, carved warning symbols, faint magical mist at threshold, deep underground maze"
    }
  },
  "MazeCrystalHalls": {
    "name": "The Crystal Halls of the Maze",
    "full_description": "A corridor of shimmering crystal walls deep underground that reflect and refract light in dazzling patterns. Multiple reflections of the traveler stretch in every direction. Some reflections show the truth; others are illusions hiding danger. Natural crystal formations have been carved into an intricate labyrinth.",
    "description_components": {
      "architecture": "Underground corridor with walls of magical crystal, floor of polished stone tiles in colored patterns, crystal ceiling lost in reflected light, multiple branching paths",
      "atmosphere": "Disorienting and beautiful underground crystal cavern, magical energy pulsing through crystals, sense of being watched by own reflections, puzzle to be solved",
      "lighting": "Prismatic magical light refracting through crystals, colors shifting and dancing, no clear light source - crystals themselves glow, shadows moving unexpectedly",
      "key_features": "Crystalline walls reflecting infinite images, colored floor tiles that may shift or trap, floating motes of magical light, false passages and real ones, deep underground crystal maze"
    }
  },
  "MazeSwordRoom": {
    "name": "The Sword Guardian Chamber",
    "full_description": "A circular chamber deep within the crystal maze where three enchanted swords float on pedestals. When the center is crossed, the swords animate and attack. A control crystal glows in the high domed ceiling, the key to disabling the guardians. Natural crystal formations ring the chamber.",
    "description_components": {
      "architecture": "Circular underground stone chamber with natural crystal dome ceiling, three stone pedestals arranged in triangle, single entrance and exit, large crystal embedded in ceiling center",
      "atmosphere": "Deadly trap room deep underground, tension before triggering, magical energy crackling, weapons poised to strike",
      "lighting": "Faint glow from floating swords, control crystal pulsing with blue light above, dim ambient magical light from surrounding crystals",
      "key_features": "Three floating enchanted swords on pedestals, central trigger zone on floor, glowing control crystal in crystal ceiling, scorch marks and old damage on walls from past battles"
    }
  },
  "MazeRiddleDoor": {
    "name": "The Riddle Door",
    "full_description": "A massive stone door carved with mysterious symbols blocks the path deep in the underground maze. When approached, a hollow voice speaks a riddle, echoing through the crystal corridors. The door only opens when the correct answer is spoken. Beyond lies the final chamber of the maze.",
    "description_components": {
      "architecture": "Massive stone door 10 feet tall carved from cave wall, carved with map-like symbols and ancient runes, no visible handle or mechanism, recessed into crystalline wall",
      "atmosphere": "Ancient puzzle guardian deep underground, echoing voice bouncing off crystal walls, sense of ancient wisdom testing the worthy",
      "lighting": "Symbols on door glow faintly when riddle is spoken, otherwise dim magical ambient light from surrounding crystals",
      "key_features": "Carved stone door with map and geographical symbols, speaking face carved in stone above door, runes that glow when riddle activates, smooth floor worn by ancient footsteps"
    }
  },
  "PseudodragonAlcove": {
    "name": "Hidden Alcove - Pip's Refuge",
    "full_description": "A small hidden alcove behind a cracked crystal column deep in the underground maze. A tiny injured pseudodragon has taken shelter here, its wing bent at a wrong angle. Tiny treasures - shiny stones, a lost coin, a broken crystal - surround its makeshift nest in the cave hollow.",
    "description_components": {
      "architecture": "Small natural cave alcove behind cracked crystal column, just large enough for a cat-sized creature, partially hidden from main underground path",
      "atmosphere": "Secret hiding spot in underground labyrinth, injured creature in need, opportunity for compassion, potential friendship",
      "lighting": "Dim reflected light from maze crystals, soft glow from pseudodragon's scales, cozy darkness of hidden cave nook",
      "key_features": "Cracked crystal column partially concealing entrance, nest of soft moss and fabric scraps, tiny treasure collection of shiny objects, injured pseudodragon with bent wing, underground hiding spot"
    }
  },
  "DarkGrove": {
    "name": "The Cursed Mushroom Grove",
    "full_description": "A vast underground cavern filled with giant petrified mushrooms, now blackened and dead. Where once towering fungi glowed with life, now only darkness remains. Shadows move with malevolent purpose around a trapped pegasus. A dark crystal pulses with evil energy at the base of the largest dead mushroom tree, source of the corruption.",
    "description_components": {
      "architecture": "Underground cavern filled with giant petrified mushroom formations now dead and blackened, gnarled fungal stalks reaching like claws toward cave ceiling, ground covered in dead spores, largest mushroom tree in center",
      "atmosphere": "Oppressive darkness in underground grove, cold malevolent energy, noble creature in peril, shadows moving with purpose, evil to be defeated",
      "lighting": "Unnatural darkness despite normally bioluminescent cave, sickly purple glow from curse crystal, shadows deeper than they should be, all natural cave light extinguished",
      "key_features": "Dead blackened giant mushrooms with claw-like caps, cursed pegasus bound by shadow chains, circling shadows with malevolent eyes, pulsing dark crystal at base of largest mushroom, corrupted underground grove"
    }
  },
  "SkyFlight": {
    "name": "Flight Through the Great Cavern",
    "full_description": "Soaring through the Great Cavern - the largest underground space in the realm, so vast its ceiling is lost in darkness above. Riding on the back of a magnificent pegasus, wind rushing past. Below, the interconnected cavern world spreads out - the maze entrance, the tower cavern, the bridge chasm, all visible from above. Ahead, the Temple cavern glows, but something is wrong - darkness surrounds it.",
    "description_components": {
      "architecture": "Impossibly vast underground cavern, ceiling lost in darkness miles above, flying high above the cavern floor, other cave systems visible below as glowing dots",
      "atmosphere": "Exhilarating flight through underground vastness, freedom and wonder, wind rushing past, but growing dread as darkness around Temple becomes visible",
      "lighting": "Distant bioluminescent clusters below like underground stars, Temple's four colored glows visible ahead, darkness creeping around Temple glow, vast shadowy space above and around",
      "key_features": "Pegasus wings spread wide in flight through cavern, underground world visible far below as glowing points, vast dark space around, Temple with four glowing towers ahead surrounded by creeping shadow"
    }
  },
  "CorruptedTemple": {
    "name": "Temple Under Shadow",
    "full_description": "The Temple of Aspects transformed by dark magic deep underground. The grand cavern cathedral where the ceremony began is now cold and dark. The great ceiling crystals have dimmed, banners are torn, pillars cracked, and an unnatural mist seeps from the temple doors. The beloved NPC is trapped within.",
    "description_components": {
      "architecture": "Same underground temple cavern but corrupted - cracked pillars, torn banners, shattered ceremonial items, temple doors hanging open, stalactites dripping dark water",
      "atmosphere": "Sacred underground place violated, cold dread, urgency to save loved one, final confrontation approaching",
      "lighting": "Dim and sickly, colored ceiling crystals flickering weakly, cold mist diffusing what light remains, unnatural darkness pooling in cavern corners",
      "key_features": "Cracked and dimmed aspect pillars, torn colorful banners, cold mist seeping from temple doors, scattered ceremonial items, frightened Elder at entrance, corrupted underground cathedral"
    }
  },
  "ShadowHalls": {
    "name": "Temple Shadow Halls",
    "full_description": "The corridors deep within the underground Temple, once bright and sacred with crystal light, now filled with creeping shadow and echoes of past trials. Ghost images of the challenges faced earlier appear - shadow wolves, goblin spirits, maze echoes - testing the hero one final time in these haunted underground passages.",
    "description_components": {
      "architecture": "Underground temple interior corridors, high carved ceilings with sacred runes, now obscured by shadow, floor tiles in Aspect colors now dim, natural rock walls mixed with carved stone",
      "atmosphere": "Haunted underground reflection of the journey, echoes of past trials bouncing off cave walls, determination to reach the sanctum, everything faced before returning",
      "lighting": "Deep shadows with occasional flickers of colored light from Aspect crystals, ghostly glow from apparitions, most crystal lights extinguished",
      "key_features": "Long underground corridor toward inner sanctum, ghostly echoes of trial creatures, flickering Aspect symbols on walls, sanctum doors visible at far end, cave passages"
    }
  }
}
